# 데이터 정제
### 결측치 확인, fillna, dropna 등
### 연속적 데이터 -> cut, qcut 이용 원하는 결과 -> 이산화
### get_dummies -> 원하는 더미 변수
### merge, concat, combine_first: 어떤 결과가 나오고, 어떤 메소드를 사용해야 하는지 잘 이해하고 있어야 함
### concat: axis, join 옵션 중요

## 결측치 표현
### NaN / None으로 표현(Nan: float64, None: 파이썬 내장 객체)

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## 결측치 표현 및 확인

In [2]:
float_data = Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

## 결측치 골라내기(dropna)

In [5]:
data = Series([1, np.nan, 3.5, np.nan, 7])

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data[data.notna()]  # 불리언 객체를 이용한 색인

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                  [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()   # default: how='any' axis='index'

     0    1    2
0  1.0  6.5  3.0

### how

In [12]:
data.dropna(how="all")  # 모든 데이터가 결측치일 때만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

### axis

In [13]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna(axis="columns", how="any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

### thresh

In [15]:
df = DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

In [16]:
df

          0         1         2
0 -1.174437       NaN       NaN
1 -0.413154       NaN       NaN
2 -0.619094       NaN -0.291778
3 -0.686616       NaN -1.533526
4  0.272712 -0.797820  1.060388
5  2.340311  0.361981 -1.386035
6 -0.422540  0.243202  0.352387

In [17]:
df.dropna()

          0         1         2
4  0.272712 -0.797820  1.060388
5  2.340311  0.361981 -1.386035
6 -0.422540  0.243202  0.352387

In [18]:
df.dropna(thresh=2) # 결측치가 thresh의 개수보다 적은 개수를 반환

          0         1         2
2 -0.619094       NaN -0.291778
3 -0.686616       NaN -1.533526
4  0.272712 -0.797820  1.060388
5  2.340311  0.361981 -1.386035
6 -0.422540  0.243202  0.352387

## 결측치 채우기(fillna)

In [19]:
df

          0         1         2
0 -1.174437       NaN       NaN
1 -0.413154       NaN       NaN
2 -0.619094       NaN -0.291778
3 -0.686616       NaN -1.533526
4  0.272712 -0.797820  1.060388
5  2.340311  0.361981 -1.386035
6 -0.422540  0.243202  0.352387

In [20]:
df.fillna(0)    # 결측치를 0으로 채워줌

          0         1         2
0 -1.174437  0.000000  0.000000
1 -0.413154  0.000000  0.000000
2 -0.619094  0.000000 -0.291778
3 -0.686616  0.000000 -1.533526
4  0.272712 -0.797820  1.060388
5  2.340311  0.361981 -1.386035
6 -0.422540  0.243202  0.352387

### 딕셔너리를 통한 결측치 채우기

In [21]:
df.fillna({1: 0.5, 2: 0})   # feature 별로 다른 결측치

          0         1         2
0 -1.174437  0.500000  0.000000
1 -0.413154  0.500000  0.000000
2 -0.619094  0.500000 -0.291778
3 -0.686616  0.500000 -1.533526
4  0.272712 -0.797820  1.060388
5  2.340311  0.361981 -1.386035
6 -0.422540  0.243202  0.352387

### method
reindex 할 때 결측치가 많이 발생함 -> 결측치를 채우기 위해서 method 사용 가능한 것처럼
DataFrame에서도 사용 가능

In [22]:
df = DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

In [23]:
df

          0         1         2
0  0.168637  0.009983  1.390758
1 -0.161670 -1.026243 -0.572499
2 -0.891792       NaN -0.350769
3  0.074048       NaN -0.311476
4 -0.805326       NaN       NaN
5 -0.395063       NaN       NaN

In [24]:
df.fillna(method="ffill")   ## 전의 값으로 채워줌

C:\Users\hello\AppData\Local\Temp\ipykernel_33564\3665968059.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")   ## 전의 값으로 채워줌

          0         1         2
0  0.168637  0.009983  1.390758
1 -0.161670 -1.026243 -0.572499
2 -0.891792 -1.026243 -0.350769
3  0.074048 -1.026243 -0.311476
4 -0.805326 -1.026243 -0.311476
5 -0.395063 -1.026243 -0.311476

In [25]:
df.fillna(method="ffill", limit=2)  # limit: 결측치를 채울 개수 조정 가능

C:\Users\hello\AppData\Local\Temp\ipykernel_33564\739359190.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)  # limit: 결측치를 채울 개수 조정 가능

          0         1         2
0  0.168637  0.009983  1.390758
1 -0.161670 -1.026243 -0.572499
2 -0.891792 -1.026243 -0.350769
3  0.074048 -1.026243 -0.311476
4 -0.805326       NaN -0.311476
5 -0.395063       NaN -0.311476

In [26]:
data = Series([1., np.nan, 3.5, np.nan, 7.])

In [27]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [28]:
data.fillna(data.mean())    # 결측치를 평균으로 채워줌

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 데이터 변형
## 함수나 매핑을 이용하여 데이터 변형

In [29]:
data = DataFrame({"food": ["bacon", "pulled pork", "bacon",
                           "pastrami", "corned beef", "bacon",
                           "pastrami", "honey ham", "nova lox"],
                    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [30]:
data    # DataFrame 요소 별 적용: applymap

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
# 매핑 할 딕셔너리 생성
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [32]:
# data["food"]만 가져왔으므로 Series 형태 -> map 이용
data["animal"] = data["food"].map(meat_to_animal)

In [33]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
def get_animal(x):
    return meat_to_animal[x]

In [35]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [36]:
df = DataFrame(np.random.standard_normal((7, 3)))

In [37]:
df

          0         1         2
0 -1.296786 -0.418293  0.965971
1 -0.851753 -0.929460  0.221617
2 -0.607037 -0.830315 -0.680006
3  1.867569  0.312942  0.697279
4 -1.440293 -0.819443 -0.465744
5  0.057686 -0.172301  0.258059
6 -0.452518  0.712979  0.206572

In [38]:
df.applymap(lambda x: x**2)

C:\Users\hello\AppData\Local\Temp\ipykernel_33564\1911323247.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x**2)

          0         1         2
0  1.681655  0.174969  0.933100
1  0.725483  0.863896  0.049114
2  0.368493  0.689424  0.462408
3  3.487816  0.097933  0.486197
4  2.074443  0.671487  0.216918
5  0.003328  0.029687  0.066594
6  0.204773  0.508338  0.042672

## 값 치환하기

### replace

In [39]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [40]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace(-999, np.nan)  # replace(바꾸고 싶은 값, 바꿀 값)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 축 색인 이름 바꾸기
- map이나 rename 이용하여 변경 가능

### map

In [43]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [44]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [45]:
def transform(x):
    return x[:4].upper()

In [46]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [47]:
data.index = data.index.map(transform)

In [48]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### rename

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [50]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [51]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## 이산화
- 연속적인 데이터를 이산적 데이터로 분할
- 분석을 위해 그룹으로 나눔

### cut, qcut < 중요!!
- pd.cut(x, bins, labels, right)
- x: 이산화 하기 위한 Series/리스트
- bins: 범위값을 나타냄
- labels: 이산화 된 데이터를 부를 이름
- right: 오른쪽에 포함/왼쪽에 포함

### cut

In [52]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [53]:
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
pd.cut(ages, bins, right=False) # 우측 값 포함 x -> 다음 그룹으로 넘어감

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [55]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

### qcut

In [56]:
data = np.random.standard_normal(1000)

In [57]:
data

array([ 1.02368673e+00, -1.55696255e+00, -1.71554089e+00, -5.38960661e-01,
        3.02371591e-01,  4.36212010e-01, -2.15198012e-01, -2.03081188e-01,
        2.22976197e-01, -1.21490021e+00,  9.50654459e-01,  3.32909661e-01,
       -1.23261675e+00, -1.86740802e+00,  1.26510170e+00,  1.04565999e+00,
        1.44874372e+00,  5.22818233e-01,  4.93792054e-01,  1.24925341e+00,
        6.89722948e-01,  3.25561290e-01,  1.94742336e+00,  4.99631797e-01,
       -6.47891410e-01, -6.49050672e-01,  2.03857110e-01,  8.70698134e-02,
       -3.22559184e-01,  7.48181249e-01,  1.52205875e+00, -3.13423827e-01,
       -4.72698342e-01, -1.17040894e+00,  1.00573741e+00, -3.94085322e-01,
        3.17307104e-01, -1.61028381e+00,  1.06638186e+00, -8.46062070e-01,
       -1.41085360e+00,  1.26863206e-01,  1.71951883e+00,  1.44659492e+00,
        2.08575321e-01, -1.68224582e+00,  3.73391838e-02, -1.53602644e+00,
       -9.97458076e-01,  2.14160658e+00,  9.26575322e-02, -3.74505418e-01,
        9.43845927e-01, -8.02660493e-01,  7.75814448e-02,  8.42487428e-02,
       -5.04839165e-02,  6.11623549e-02, -1.18578256e+00, -6.37973298e-01,
        3.10073534e-01,  6.76428465e-01, -4.33800079e-01, -1.49899116e+00,
       -7.10003048e-01,  5.39134439e-01,  1.14441835e-01, -1.98108349e+00,
        2.68936641e+00,  7.48849156e-01, -1.15698527e+00,  1.34404777e+00,
       -5.20316042e-01, -6.65014199e-01,  1.23329783e+00, -4.82918274e-01,
        3.75601331e-01, -1.21546918e+00, -2.29147705e-01,  5.19251870e-01,
       -7.49168309e-02,  6.39892267e-01,  9.39712389e-01, -1.28671073e-01,
        1.32250271e+00,  6.00113963e-01,  1.37300869e+00,  3.43992349e-01,
        1.74053108e-01, -1.57522513e+00, -3.15471950e-02, -5.27183468e-02,
       -5.83108694e-01,  3.54414404e-01,  8.48497179e-02, -7.61425503e-01,
        4.66149732e-01,  1.08365215e-01, -5.98456644e-01, -6.20428499e-01,
        4.24839362e-01, -1.07999088e+00,  5.55165490e-01, -8.24489371e-01,
       -5.03223915e-01,  1.47541329e+00, -3.56417103e-01,  2.31990925e+00,
       -2.09879781e-01,  2.37984955e-01,  4.17079411e-01,  8.75328384e-01,
       -1.38862302e-01,  1.45881008e+00, -1.53604686e+00,  1.71717255e+00,
       -2.16743159e+00,  1.32240461e+00,  4.04733621e-01, -9.00200986e-01,
        8.68412530e-02,  9.50575406e-01,  1.56319503e+00, -6.81034446e-01,
        4.50828482e-01, -2.24247931e-01, -1.62414617e+00, -1.60528716e-01,
        1.24417490e+00, -4.50416552e-02,  1.81206522e-01, -1.49891316e-01,
        5.27995567e-04,  1.45785502e+00,  9.50337147e-03,  1.36527396e+00,
        7.84891696e-01, -5.66213520e-01, -2.83920411e-01, -1.01243628e+00,
       -9.33917054e-01, -9.32831406e-01, -6.75942953e-01,  2.79712815e-01,
       -2.19088314e+00,  2.18765223e+00, -1.52159646e+00,  7.43608902e-01,
       -1.50815008e-01,  9.94820320e-01,  2.74143981e-01,  3.84474852e-01,
        2.52926393e+00, -1.22164508e+00, -1.52831201e+00,  2.11021922e-01,
       -1.86700041e+00,  7.69755885e-01,  5.08131630e-01, -2.72412155e-01,
       -1.95370923e+00, -2.68611232e-01, -7.24538514e-01,  6.74184033e-01,
       -1.44040841e+00, -1.15190875e+00, -4.17356985e-01, -5.07875493e-01,
       -7.25182373e-01,  5.69262035e-01,  5.05256657e-01, -7.60407795e-02,
        4.93518946e-01,  5.55564757e-01, -1.61303029e+00, -8.89234559e-01,
       -1.12770163e+00,  6.32911311e-01,  7.25779592e-01, -5.67974535e-01,
       -1.96196218e-01, -3.68455768e-01, -7.26169701e-01, -1.23955936e+00,
        8.18487356e-01,  2.01326026e+00, -7.24365413e-02,  1.76211856e-01,
        9.41245613e-01,  1.18108398e+00, -1.89251943e+00, -6.78226803e-01,
        9.35610287e-01,  5.84281715e-01,  3.18882332e-01,  1.41027214e-01,
       -7.52941654e-01,  2.90092669e-01, -2.14668194e-01,  8.59101460e-01,
       -1.74101017e+00, -3.76984516e-01,  9.94502743e-01, -1.46436492e+00,
       -1.87973005e+00,  8.32706926e-01,  8.46483831e-01,  4.98568978e-01,
        3.82876427e-01,  1.13023796e+00, -1.64392459e+00, -5.69946482e-01,
       -1.74618439e-01, -9.55813772e-03, -1.45304383e+00,  4.50960916e-01,
        1.14259769e+00,  3.28422012e-01, -6.69983469e-01,  1.75671013e+00,
        1.08762913e+00, -2.02686557e+00, -1.11834973e+00,  9.58184818e-01,
        3.13761113e-01, -3.17535281e-01, -8.60961309e-01, -9.25131989e-01,
       -1.28264799e+00, -1.86413936e+00,  6.30905509e-01, -8.09237116e-01,
        4.47993589e-01,  9.92881606e-01, -7.55464626e-01, -1.36304262e+00,
        5.08488110e-01, -8.03240359e-01,  1.04404570e+00, -6.99910022e-01,
       -6.94169765e-01,  4.10873091e-02, -1.62368263e+00,  3.26007792e-01,
        9.32697982e-01,  1.43068627e+00,  2.38415044e-01, -3.03209669e-01,
       -9.75252663e-03, -1.75895713e+00,  3.03914969e-01,  1.45812868e+00,
        1.88318401e+00,  3.31991305e-01, -4.19448289e-01, -1.56799483e-01,
        4.44444594e-02, -2.26826488e-01, -8.98708521e-01,  1.18712208e+00,
       -1.32576365e+00, -1.41042281e-01,  5.17272840e-01,  2.90787510e-01,
        3.52720628e-01,  9.49470260e-02, -3.76237213e-01,  1.53550485e+00,
        9.49295362e-01, -3.56375590e-01,  1.58254806e-01,  5.27270940e-01,
        1.16982679e-01, -7.21583630e-01,  4.62193300e-01, -2.52831772e-01,
       -9.07079710e-02, -2.81808614e-01,  2.01233189e-01,  5.73696907e-02,
       -1.90773321e+00,  6.39422616e-01,  9.89991919e-01,  4.93755066e-01,
       -4.45222092e-01,  1.24534861e-01,  5.94285679e-01,  4.63188813e-01,
        1.54010592e+00,  1.12230511e+00,  1.65970561e+00,  2.08885143e+00,
        7.60087477e-01,  6.35773057e-01,  3.54783185e+00, -7.95967028e-01,
        1.45453970e+00, -6.58084728e-01, -1.37072086e+00, -6.72342598e-01,
        5.45124982e-01, -5.97546998e-01, -2.38957452e-01, -3.44533772e-01,
        2.15512080e-01, -3.76429340e-01, -2.89760771e-01,  1.56816888e-02,
       -1.59424918e-01,  1.54053390e+00,  3.85105253e-01,  1.83408639e+00,
        9.79899472e-01,  1.01962366e+00, -2.77670460e-01,  1.67247677e-01,
       -4.55276038e-01, -8.17355750e-01, -1.21272339e+00, -8.43473324e-01,
        1.12845336e+00,  1.33077155e+00, -4.53015183e-01, -9.13252161e-01,
        1.28382281e-01, -1.01253301e+00,  3.24822877e-01, -1.19804077e+00,
        1.05223656e-01, -6.08592287e-01,  1.31103333e+00,  1.69460946e-01,
       -1.20866468e-01,  2.59543379e-01,  3.54996747e-01, -8.91050916e-01,
        2.75759166e-01, -2.12406680e+00, -8.18519167e-01,  9.22338497e-01,
       -9.18883092e-01,  3.87685519e-01, -1.20613567e+00,  1.37046133e+00,
       -8.68726722e-01,  2.36120430e-01, -1.38701002e+00,  1.12094005e+00,
       -1.05763351e+00,  4.56897631e-01,  1.46480127e+00, -7.68189056e-02,
        9.65724355e-02, -2.48817145e-01,  9.33928979e-01, -9.23605478e-03,
       -8.97594278e-01,  2.00237832e+00,  8.03669586e-01, -7.59961004e-01,
        1.90071285e-01,  2.31390345e+00,  1.29157515e+00,  5.16108443e-02,
       -2.78464726e+00,  1.73118137e-01, -6.10036531e-01, -7.25975353e-03,
        7.93009023e-02, -3.37665299e-01, -2.87749304e-01,  4.06141824e-02,
       -3.97704307e-01, -1.02134686e+00, -1.12036922e+00,  3.62759849e-01,
       -1.43557662e+00, -6.38909533e-01, -1.46782467e-01,  1.60564929e-01,
        1.41109971e+00,  5.42876725e-01,  1.13597144e-01,  5.99858268e-01,
       -2.76464922e-01, -3.78803753e-01, -2.93427759e-01, -8.14151209e-01,
       -1.95553203e-01, -6.51990980e-01, -4.11133659e-01,  6.59967134e-01,
       -7.18663362e-01,  1.66314537e+00,  6.29072184e-01,  1.10095546e+00,
       -5.44291033e-01,  7.75843528e-01, -1.25312471e+00,  3.10070169e-01,
       -5.13401651e-01, -1.08628893e+00,  9.36260936e-01, -5.61796942e-01,
       -1.33738203e+00,  5.22118258e-01,  4.39468498e-01,  1.63198849e-01,
       -4.58912109e-01,  5.24830391e-01, -7.72789530e-01,  3.36992573e-02,
       -1.42002998e+00, -7.94085694e-01, -8.43592991e-01, -4.50328906e-01,
        1.91196487e+00, -9.43142516e-01,  1.28491650e+00, -2.40646584e-01,
       -1.04384558e+00, -8.96102213e-01, -8.23439410e-01, -8.62635637e-01,
        1.16512924e-02, -8.69327855e-01,  1.92841981e-01, -1.26243649e+00,
       -8.49891934e-01, -1.53032254e-01,  6.44991630e-03, -6.18313077e-01,
        7.06348400e-01, -4.71804779e-01, -1.38784678e+00, -2.03000175e+00,
        1.51212075e+00, -1.48437848e+00, -6.58290764e-02,  1.22817248e-01,
       -2.62796832e-02, -4.21537336e-01,  9.88604921e-01, -1.62561878e+00,
        1.32875408e+00,  9.32571343e-01,  1.71462759e-01, -1.95454227e+00,
       -7.13578843e-02,  1.38413257e-01, -5.48685832e-01, -7.84515934e-01,
       -4.73727485e-01, -1.63806796e+00, -6.64754467e-02,  8.16625391e-02,
        6.58042557e-01, -3.07718542e-02,  2.03225826e+00,  4.47189184e-01,
        1.00028909e+00,  1.35784456e-01,  1.02466808e+00,  2.24437739e+00,
        1.14739526e+00,  6.21273883e-01, -8.99881674e-02,  9.68346960e-01,
       -5.14040754e-01, -5.49781427e-01, -8.83127263e-01,  1.60432319e+00,
        2.10522086e+00,  4.18132238e-01, -1.30879430e+00, -1.68553174e+00,
        2.81354780e+00,  2.74852892e-01,  1.55424718e+00,  9.07664963e-01,
       -4.22256705e-01,  1.23380704e+00, -1.63419852e-01, -4.04572824e-01,
        1.14226291e+00,  1.06508729e-01,  2.44141471e-01, -5.46020219e-01,
        1.81921544e+00,  2.32468784e-02,  5.85034409e-01, -3.68800282e-01,
       -1.72402221e+00,  1.14492215e+00,  1.15283567e+00,  1.34868517e+00,
       -9.01797933e-02,  5.24409549e-01, -7.39400157e-01,  2.40241746e-01,
       -1.77579613e-02, -6.88751734e-01,  8.99119021e-01,  8.10852080e-01,
        1.07247927e+00, -7.60096809e-01, -4.58165588e-01, -4.58722430e-01,
        3.66014940e-01,  1.97024996e-01, -1.25657432e+00, -1.17030824e+00,
       -5.78157518e-01, -1.67365479e-01, -4.89537505e-01,  1.60099448e+00,
        5.65028544e-01,  1.86365720e+00,  6.57982728e-01, -1.08522968e+00,
        6.24593164e-01,  1.01797848e+00, -1.25334195e+00, -2.20798441e-01,
       -1.33008783e-01, -6.04997854e-01, -2.77979600e+00, -6.94444560e-01,
       -6.69220562e-01,  1.00956738e+00, -9.37636352e-02, -3.78872748e-01,
        1.45440074e+00, -2.28677700e+00, -5.29913568e-01,  1.70408019e+00,
       -7.07088492e-01,  1.42370273e+00,  2.21591868e-01,  4.26862467e-01,
       -2.99837679e-01,  3.92779270e-01, -1.17417488e-01, -3.41873940e-01,
       -1.29838584e+00, -1.47136621e+00,  3.68195534e-01, -8.47167269e-01,
       -9.61186552e-01,  1.75245587e+00, -6.52854090e-01, -1.76993817e+00,
       -1.08956236e+00,  2.36020849e-01,  3.64382933e-02, -7.59792163e-01,
        1.36186961e+00,  9.11597952e-01, -1.74685087e-01,  1.57723668e+00,
        1.24920178e-01, -1.24660487e+00,  2.01634639e+00,  8.92147715e-01,
        1.21237126e+00, -5.04974481e-01,  5.62423687e-01, -9.68580203e-01,
        2.62799312e-01, -2.11720604e-01, -2.04625512e+00, -1.30561305e+00,
        1.60261063e+00, -1.64145722e+00, -6.99637672e-02,  3.58869926e-01,
       -9.74476978e-01,  9.55085170e-02, -8.42789899e-01,  5.67996237e-01,
       -3.42990052e-01,  1.98076236e-01,  1.12417784e-01,  2.29154867e-01,
        1.24141351e+00, -4.86451776e-01,  1.34091856e+00,  7.59938828e-01,
       -1.08651026e+00,  4.52003401e-02,  4.08165509e-01, -9.99422119e-01,
        7.64198623e-01, -3.51516409e-01,  1.71395107e+00,  8.13808639e-01,
       -1.88226358e-01, -1.67511846e+00, -1.08838677e+00, -1.48902958e-01,
       -7.05937000e-01, -1.17633970e-01, -6.13436959e-01,  5.80069956e-01,
       -1.06566956e+00,  1.07115349e+00, -2.13386649e+00,  7.79816119e-01,
        9.76149210e-01, -4.14047435e-01,  1.22636611e+00,  4.18265859e-01,
        1.06453868e+00,  2.18311697e+00, -8.29777179e-01,  7.99712208e-02,
        8.63206278e-01,  1.83532855e+00,  5.37694599e-01, -2.25527128e-01,
       -2.96702055e-01,  1.50354156e+00,  1.28411326e+00, -5.16033086e-01,
       -1.46650069e+00, -7.74953802e-01,  1.52219181e+00, -3.76517934e-01,
        8.34439213e-01,  1.37423541e-01, -1.53980748e+00,  1.04517379e-01,
        1.33607981e+00, -7.74540304e-01, -2.79422646e-01, -4.91733817e-01,
        3.36489450e-01,  1.67028616e+00, -1.31767379e-01,  2.68035650e-01,
        1.05144448e+00, -4.48537626e-01,  9.38989176e-01,  1.46951607e+00,
       -1.01678707e+00,  1.29542077e+00, -3.40339301e-01,  3.17376709e-01,
        6.05285056e-01, -4.50707417e-01,  2.29123810e+00, -1.18379231e+00,
        8.36748435e-01, -1.09125088e+00, -4.14978649e-01,  9.35422169e-01,
        8.46631527e-01, -7.21232791e-01,  1.28527734e+00, -9.87692121e-01,
       -4.87635885e-01, -2.03450133e+00, -6.08565597e-01, -1.00628021e+00,
        1.56979384e+00, -2.45831203e+00, -7.92641604e-01, -8.75775266e-01,
        7.17608646e-01,  7.95683396e-01,  1.62736498e-01,  2.60789721e-01,
        4.18831107e-01, -2.12067547e-01, -7.65404938e-01, -9.15719350e-01,
        1.17141518e+00,  5.22786455e-01,  4.02011304e-02,  4.84308920e-02,
        7.95985118e-01, -5.57504018e-01,  2.52178400e-01,  5.97824009e-01,
       -3.86687096e-01, -2.83733056e-01,  6.12118533e-02,  1.68436146e+00,
       -1.55356694e-01,  4.08293465e-01, -1.94714007e-01, -1.54669925e+00,
       -5.45343678e-01, -3.15804401e-01,  3.28367354e-01, -3.69383195e-01,
        1.30560900e+00,  9.28803766e-01, -2.66839563e-01,  1.51073395e-01,
       -2.46648688e+00, -1.44356676e+00, -4.66897558e-01,  4.83984139e-01,
        5.43716826e-01, -7.39103535e-01,  1.75989297e+00, -1.28006321e-01,
       -1.26584313e-01, -1.26781642e+00,  1.42811618e-01, -1.26535468e+00,
       -7.91475161e-01,  1.87666986e+00,  1.50546470e+00,  8.93358850e-01,
        1.60416036e-01,  4.44508375e-01,  1.03636595e+00,  2.09843342e+00,
       -1.86479998e+00,  9.25664340e-01, -1.78233548e+00,  4.78369339e-01,
       -1.97452480e+00, -8.61034133e-01, -1.10283946e+00,  5.75897819e-01,
        9.10951676e-01, -8.81327042e-01,  1.95967377e-01,  5.85859668e-01,
        8.58338028e-01,  1.18772899e+00,  1.15493673e+00,  1.43436076e+00,
       -2.75772379e-01,  1.27386578e+00,  8.12669555e-01, -1.82595645e+00,
       -4.18523153e-01, -1.25027526e-01, -1.28613006e-01, -5.11594951e-01,
       -1.50720969e+00,  3.26188654e-01,  2.33726514e+00,  1.50758757e-01,
        1.16294334e+00,  4.76113584e-01,  2.00707902e-01,  5.18498330e-01,
        9.61506719e-01, -7.26138454e-01,  4.33890013e-01,  7.28983032e-01,
       -4.07368332e-01, -8.62405131e-02, -1.07956333e+00, -1.16244774e-01,
       -1.69323267e+00,  1.61255237e-01,  6.10804302e-01, -2.61271801e-01,
        8.74725563e-01, -1.07384648e-01,  1.68049911e-02,  3.68247954e-01,
       -2.47767860e+00, -1.79033128e-01,  5.47929360e-01, -9.60142600e-01,
       -5.87833024e-01, -1.18153353e+00,  2.04724913e+00, -1.02475059e+00,
       -1.06870017e-01, -1.11843042e+00,  5.82355439e-01, -9.58496919e-01,
       -1.38437158e+00,  1.15989274e-01,  5.04081425e-01,  1.79869771e+00,
       -1.83265756e+00,  1.25558839e+00, -2.05403083e+00, -2.08199217e+00,
        1.16859714e-01, -5.38010112e-01, -1.69384217e+00,  3.51991356e-01,
       -7.89346541e-01, -1.15846862e-02, -5.22072619e-01,  1.61466536e+00,
       -1.57724029e+00,  1.13720377e+00,  1.07029842e-01, -9.12400119e-01,
        1.38674940e+00, -9.85298048e-01,  6.46457801e-01, -3.61857722e-01,
       -8.71004581e-01,  2.65559519e-01,  2.29474063e-01,  4.94038506e-01,
       -6.52817148e-01, -9.00722220e-01, -3.72227763e-01,  8.45197806e-01,
        3.11681671e-01,  7.11155911e-01, -1.65643685e+00,  5.17987035e-01,
       -4.51851184e-02, -1.00624125e-01,  8.84321016e-01,  6.17816704e-01,
        4.11691096e-01, -1.20321574e+00,  1.64552636e+00,  1.14650291e+00,
       -1.10897173e+00,  3.82637662e-01,  3.65291353e-01,  1.21507563e+00,
        2.25075393e+00,  9.32765803e-01, -1.23079967e+00,  4.69183867e-02,
        4.27481050e-01,  6.90055849e-01,  1.19289318e-02, -6.90972330e-01,
        4.46588494e-01, -3.96475139e-01, -2.41719454e-01,  1.68533961e-01,
       -3.12893025e-01, -7.73235590e-02,  4.27733330e-02,  1.08538772e+00,
       -4.54942176e-01,  7.63613185e-01,  8.64214010e-01, -1.87523472e+00,
        1.66309757e+00, -9.96703749e-01,  3.33577464e-02,  2.65134131e-01,
       -9.47860189e-02, -3.40714951e-01,  1.83705352e-02,  1.15948365e+00,
        1.02408647e+00,  1.41793875e-01, -1.14266636e+00, -5.67434451e-01,
       -7.02035273e-01,  1.23762996e+00, -7.75566255e-01, -2.86493649e-01,
        1.27402523e+00, -6.23786692e-01, -7.06327458e-01, -7.74909776e-01,
       -8.97506427e-01,  3.72868877e-01,  1.23060646e+00,  2.34526472e+00,
        1.62593111e+00,  8.65814659e-03, -5.80325896e-01,  2.24086205e+00,
       -9.34990336e-01, -1.37579635e+00, -6.39983519e-01, -1.79244707e-01,
        2.79167147e-01, -8.56649613e-01, -2.05175557e+00, -1.63488649e+00,
        3.03669452e-02,  3.58873801e-01, -1.27323956e+00, -7.22455281e-01,
        9.90140840e-01,  8.59674952e-01, -7.10922191e-01,  5.65171648e-01,
        6.11489791e-01,  2.72198799e-01,  1.71488468e-01, -2.37527331e-01,
       -8.93873398e-01, -2.77368375e-01, -4.80303514e-01, -1.06361754e+00,
        1.21725817e+00, -9.89056840e-02, -4.36947218e-01, -7.60483350e-02,
       -3.12478586e-02,  1.13071389e+00,  9.95003190e-02,  8.71531750e-01,
        2.56633107e-01, -9.55807599e-03, -8.70003557e-01, -1.69430431e+00,
       -1.08890618e+00, -3.93965603e-01,  2.26416664e-01, -9.12095459e-01,
       -7.36720910e-01, -1.93922303e-01, -1.77892817e-01, -1.49150771e-01,
        3.46535120e-01, -1.24785241e+00,  4.69200730e-01,  4.98443276e-01,
       -1.02053769e+00, -2.27335391e-01, -6.26681109e-01, -4.10506145e-01,
        1.77835864e+00, -1.15414954e+00, -6.20601720e-01, -4.73484677e-01,
        1.19571677e+00, -2.39421671e+00,  2.12331564e+00, -4.48481996e-01,
       -1.13997631e+00,  2.44022547e-01,  5.39954823e-01,  1.58097720e-01,
       -1.74630187e-02,  2.24314305e-01, -2.80703506e-01,  5.25017953e-01,
        1.15923232e+00, -1.72468438e+00,  6.80001911e-01,  9.38424687e-02,
       -1.45942263e+00, -9.12517944e-01, -5.11569302e-01, -1.32358810e+00,
        1.50243203e+00, -2.79305656e-01, -3.12254552e-01, -7.35570190e-01,
       -4.15085628e-01, -6.38661408e-01, -7.61857653e-01,  1.43602701e+00,
       -4.08184367e-01,  6.28732212e-01,  7.97567810e-01,  1.17654072e+00,
        3.54805010e-01,  9.03001164e-01,  4.33909153e-01,  3.36521958e-02,
       -1.73913137e-01,  2.18708987e-01,  7.86715173e-01,  4.47971855e-01,
        4.70643046e-01,  4.51263941e-01,  1.41231374e+00, -1.98017479e+00,
       -1.32426234e+00, -8.04358717e-01,  1.86597102e+00, -2.32845044e-01,
        2.61398809e-01, -2.30651272e-01, -1.58326597e-01,  1.14436374e-01,
       -2.43927983e+00,  2.08734425e-02, -5.51346132e-01, -2.35125620e+00,
       -1.20378651e+00,  7.71712830e-02,  1.35801182e+00,  1.97661057e-01,
        9.93918074e-01, -1.55786579e-01, -2.45309011e-01,  5.46758551e-01,
       -6.78950748e-01,  2.94298466e-01, -7.15288834e-01,  2.52155216e-01])

In [58]:
# 균등한 길이의 그룹을 계산
quartiles = pd.qcut(data, 4, precision=2)   # precision: 정밀도, 소숫점 아래 자리
quartiles

[(0.63, 3.55], (-2.7899999999999996, -0.68], (-2.7899999999999996, -0.68], (-0.68, 0.014], (0.014, 0.63], ..., (0.014, 0.63], (-0.68, 0.014], (0.014, 0.63], (-2.7899999999999996, -0.68], (0.014, 0.63]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.7899999999999996, -0.68] < (-0.68, 0.014] < (0.014, 0.63] < (0.63, 3.55]]

In [59]:
pd.value_counts(quartiles)

C:\Users\hello\AppData\Local\Temp\ipykernel_33564\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-2.7899999999999996, -0.68]    250
(-0.68, 0.014]                  250
(0.014, 0.63]                   250
(0.63, 3.55]                    250
Name: count, dtype: int64

In [60]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.786, -1.253]    100
(-1.253, 0.0138]    400
(0.0138, 1.286]     400
(1.286, 3.548]      100
Name: count, dtype: int64

## 이상치를 찾고 제외하기

### 이상치(outlier)
- 전체적인 데이터 분포에서 크게 어긋나는 값

In [61]:
data = DataFrame(np.random.standard_normal((1000, 4)))

In [62]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000196     0.003886    -0.007439     0.010269
std       0.959833     1.001781     0.978193     1.020300
min      -3.194138    -3.016900    -3.285988    -3.547791
25%      -0.641892    -0.646270    -0.707444    -0.634128
50%       0.006064    -0.001749    -0.013333    -0.005702
75%       0.606911     0.610909     0.698373     0.691703
max       3.333167     3.691697     2.594968     3.118949

In [63]:
data.abs() > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [64]:
(data.abs() > 3).any(axis="columns")    # 이상치가 하나라도 있는 data 호출

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [65]:
np.sum((data.abs() > 3).any(axis="columns"))

13

In [66]:
# 이상치가 아닌 데이터만 호출
data.loc[~(data.abs() > 3).any(axis="columns"), :]

            0         1         2         3
0    2.283713 -0.112298  0.343960  1.459407
1   -1.303638 -0.286452 -0.412451  0.975693
2   -0.284645 -0.451557 -1.421824  0.393213
3    0.847656  1.558511  1.627163 -0.596578
4   -0.156674  0.613022  0.374437  1.334854
..        ...       ...       ...       ...
995 -0.110940  0.867648 -1.251747  1.279438
996  0.774351  0.003808  0.082059 -0.509909
997 -0.077599 -0.763837  1.125724 -0.802538
998  0.766026  1.812280  0.703633 -0.735357
999 -0.406689  0.357190 -0.492316 -0.206523

[987 rows x 4 columns]

In [67]:
data.index[(data.abs() > 3).any(axis="columns")]

Index([212, 257, 264, 339, 376, 494, 594, 608, 626, 844, 858, 919, 975], dtype='int64')

In [68]:
# 이상치가 있는 데이터 제거
data.drop(data.loc[(data.abs() > 3).any(axis="columns")])

            0         1         2         3
4   -0.156674  0.613022  0.374437  1.334854
5   -0.323918  1.615527  1.035298 -0.905284
6   -1.903755 -0.478938 -1.082187  1.609899
7    1.641417 -1.203826  0.308587  1.529629
8   -0.035165 -1.817159 -0.698271  0.214712
..        ...       ...       ...       ...
995 -0.110940  0.867648 -1.251747  1.279438
996  0.774351  0.003808  0.082059 -0.509909
997 -0.077599 -0.763837  1.125724 -0.802538
998  0.766026  1.812280  0.703633 -0.735357
999 -0.406689  0.357190 -0.492316 -0.206523

[996 rows x 4 columns]

In [69]:
np.sign(data) * 3

       0    1    2    3
0    3.0 -3.0  3.0  3.0
1   -3.0 -3.0 -3.0  3.0
2   -3.0 -3.0 -3.0  3.0
3    3.0  3.0  3.0 -3.0
4   -3.0  3.0  3.0  3.0
..   ...  ...  ...  ...
995 -3.0  3.0 -3.0  3.0
996  3.0  3.0  3.0 -3.0
997 -3.0 -3.0  3.0 -3.0
998  3.0  3.0  3.0 -3.0
999 -3.0  3.0 -3.0 -3.0

[1000 rows x 4 columns]

In [70]:
data[data.abs() > 3] = np.sign(data) * 3

In [71]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000259     0.002856    -0.007056     0.010927
std       0.957863     0.998285     0.976974     1.017477
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.641892    -0.646270    -0.707444    -0.634128
50%       0.006064    -0.001749    -0.013333    -0.005702
75%       0.606911     0.610909     0.698373     0.691703
max       3.000000     3.000000     2.594968     3.000000

## 표시자, 더미 변수 계산하기
- 더미 변수: 0, 1로 구성된 데이터
- 분류값 -> 더미, 표시자 행렬로 전환
- 통계 모델이나 머신러닝 애플리케이션 개발 적합
- k개의 feature로 확장, 분류값에 따라 0, 1로 나타냄

In [72]:
df = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                "data1": range(6)})

In [73]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [74]:
# Series에 적용 가능
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [75]:
# default 값은 boolean
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [76]:
# prefix로 feature 이름 조정 가능
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [77]:
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [78]:
# concat: 데이터를 이어붙임
df_with_dummy = pd.concat([df[["data1"]], dummies], axis=1)

In [79]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [80]:
values = np.random.uniform(size=10)

In [81]:
values

array([0.43421974, 0.99172736, 0.14203109, 0.66606534, 0.05176068,
       0.24271624, 0.81240759, 0.35441381, 0.92889121, 0.97492835])

In [82]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]

In [83]:
pd.cut(values, bins, labels=['a', 'b', 'c', 'd', 'e'])

['c', 'e', 'a', 'd', 'a', 'b', 'e', 'b', 'e', 'e']
Categories (5, object): ['a' < 'b' < 'c' < 'd' < 'e']

In [84]:
pd.get_dummies(pd.cut(values, bins, labels=['a', 'b', 'c', 'd', 'e']))

       a      b      c      d      e
0  False  False   True  False  False
1  False  False  False  False   True
2   True  False  False  False  False
3  False  False  False   True  False
4   True  False  False  False  False
5  False   True  False  False  False
6  False  False  False  False   True
7  False   True  False  False  False
8  False  False  False  False   True
9  False  False  False  False   True

In [85]:
pd.get_dummies(pd.cut(values, bins, labels=['a', 'b', 'c', 'd', 'e']), dtype=int)

   a  b  c  d  e
0  0  0  1  0  0
1  0  0  0  0  1
2  1  0  0  0  0
3  0  0  0  1  0
4  1  0  0  0  0
5  0  1  0  0  0
6  0  0  0  0  1
7  0  1  0  0  0
8  0  0  0  0  1
9  0  0  0  0  1

## merge

In [86]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                 "data1": Series(range(7), dtype="Int64")})
df2 = DataFrame({"key": ["a", "b", "d"],
                 "data2": Series(range(3), dtype="Int64")})

In [87]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [88]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

### 기준이 되는 feature는 기준이 되는 key
option<br>
- on: 사용하여 합칠 key
- left_on, right_on: 각기 서로 다른 key를 기준으로 합침

In [89]:
# key를 기준으로 합침
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [90]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [91]:
df3 = DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                 "data1": Series(range(7), dtype="Int64")})
df4 = DataFrame({"rkey": ["a", "b", "d"],
                 "data2": Series(range(3), dtype="Int64")})

In [92]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [93]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [94]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

### how: 병합하는 방식
- inner: 양쪽 테이블 모두에 존재하는 키 조합(교집합)
- left: 왼쪽 테이블에 존재하는 모든 키 조합
- right: 오른쪽 테이블에 존재하는 모든 키 조합
- outer: 양쪽 테이블에 존재하는 모든 키 조합(합집합)

In [95]:
pd.merge(df1, df2, how="outer")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [96]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                 "data1": Series(range(6), dtype="Int64")})
df2 = DataFrame({"key": ["a", "b", "a", "b", "d"],
                 "data2": Series(range(5), dtype="Int64")})

In [97]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [98]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [99]:
pd.merge(df1, df2, on="key", how="left")

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [100]:
pd.merge(df1, df2, on="key", how="right")

   key  data1  data2
0    a      2      0
1    a      4      0
2    b      0      1
3    b      1      1
4    b      5      1
5    a      2      2
6    a      4      2
7    b      0      3
8    b      1      3
9    b      5      3
10   d   <NA>      4

In [101]:
pd.merge(df1, df2, how="inner")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [102]:
left = DataFrame({"key1": ["foo", "foo", "bar"],
                  "key2": ["one", "two", "one"],
                  "lval": Series([1, 2, 3], dtype='Int64')})
right = DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                   "key2": ["one", "one", "one", "two"],
                   "rval": Series([4, 5, 6, 7], dtype='Int64')})

In [103]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [104]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [105]:
# 양쪽 테이블 모두에 존재하는 키 조합 사용(교집합만 추출)
pd.merge(left, right, on=["key1", "key2"], how="inner")

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [106]:
# key2_x: df1의 key2, key2_y: df2의 key2
pd.merge(left, right, on="key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [107]:
pd.merge(left, right, on="key1", suffixes=["_left", "_right"])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [108]:
left1 = DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                   "value": Series(range(6), dtype="Int64")})
right1 = DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [109]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [110]:
right1

   group_val
a        3.5
b        7.0

In [111]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

## concat: 데이터를 이어붙임

In [112]:
s1 = Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = Series([5, 6], index=["f", "g"], dtype="Int64")

In [113]:
s1

a    0
b    1
dtype: Int64

In [114]:
s2

c    2
d    3
e    4
dtype: Int64

In [115]:
s3

f    5
g    6
dtype: Int64

In [116]:
# 기본 axis=index(행 방향)
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [117]:
pd.concat([s1, s2, s3], axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [118]:
s4 = pd.concat([s1, s3])

In [119]:
s4

a    0
b    1
f    5
g    6
dtype: Int64

In [121]:
s4 = pd.concat([s1, s3], axis="columns")

In [122]:
s4

      0     1
a     0  <NA>
b     1  <NA>
f  <NA>     5
g  <NA>     6

In [125]:
df1 = DataFrame(np.random.standard_normal((3, 4)),
                   columns=["a", "b", "c", "d"])
df2 = DataFrame(np.random.standard_normal((2, 3)),
                   columns=["b", "d", "a"])

In [126]:
df1

          a         b         c         d
0  1.077683 -2.005627 -0.059873  0.334209
1 -0.579946 -0.867138 -0.808999 -1.641680
2  2.516516  1.955518  0.139142  0.827047

In [127]:
df2

          b         d        a
0 -0.543793  0.036955  0.52467
1 -0.412846  0.172095  3.22525

In [128]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  1.077683 -2.005627 -0.059873  0.334209
1 -0.579946 -0.867138 -0.808999 -1.641680
2  2.516516  1.955518  0.139142  0.827047
3  0.524670 -0.543793       NaN  0.036955
4  3.225250 -0.412846       NaN  0.172095

In [129]:
a = Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
              index=["f", "e", "d", "c", "b", "a"])
b = Series([0., np.nan, 2., np.nan, np.nan, 5.],
              index=["a", "b", "c", "d", "e", "f"])

In [130]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [131]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [132]:
np.where(pd.isna(a), b, a)  # true는 b, false는 a로 채움

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [133]:
a.combine_first(b)  # a에서 결측치인 인덱스를 b에서 찾아 채움

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

In [135]:
df1 = DataFrame({"a": [1., np.nan, 5., np.nan],
                 "b": [np.nan, 2., np.nan, 6.],
                 "c": range(2, 18, 4)})
df2 = DataFrame({"a": [5., 4., np.nan, 3., 7.],
                 "b": [np.nan, 3., 4., 6., 8.]})

In [136]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [137]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [138]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN